; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-3-17)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city0)
	(fuel-level plane1 fl3)
	(at plane2 city6)
	(fuel-level plane2 fl4)
	(at plane3 city5)
	(fuel-level plane3 fl2)
	(at person1 city5)
	(at person2 city1)
	(at person3 city9)
	(at person4 city6)
	(at person5 city0)
	(at person6 city7)
	(at person7 city1)
	(at person8 city7)
	(at person9 city8)
	(at person10 city5)
	(at person11 city3)
	(at person12 city9)
	(at person13 city8)
	(at person14 city5)
	(at person15 city1)
	(at person16 city1)
	(at person17 city4)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane1 city0)
	(at plane2 city0)
	(at plane3 city5)
	(at person1 city3)
	(at person2 city5)
	(at person3 city9)
	(at person4 city0)
	(at person5 city0)
	(at person6 city4)
	(at person7 city1)
	(at person8 city9)
	(at person9 city3)
	(at person10 city7)
	(at person11 city3)
	(at person12 city4)
	(at person13 city4)
	(at person14 city0)
	(at person15 city1)
	(at person16 city9)
	(at person17 city0)
	))

)

; plan
1. (board person14 plane3 city5)
   deleted: (at person14 city5)
   added: (in person14 plane3)
   goals met: 7 of 20
2. (board person10 plane3 city5)
   deleted: (at person10 city5)
   added: (in person10 plane3)
   goals met: 7 of 20
3. (board person1 plane3 city5)
   deleted: (at person1 city5)
   added: (in person1 plane3)
   goals met: 7 of 20
4. (zoom plane2 city6 city1 fl4 fl3 fl2)
   deleted: (at plane2 city6) (fuel-level plane2 fl4)
   added: (at plane2 city1) (fuel-level plane2 fl2)
   goals met: 7 of 20
5. (board person2 plane2 city1)
   deleted: (at person2 city1)
   added: (in person2 plane2)
   goals met: 7 of 20
6. (board person16 plane2 city1)
   deleted: (at person16 city1)
   added: (in person16 plane2)
   goals met: 7 of 20
7. (zoom plane2 city1 city0 fl2 fl1 fl0)
   deleted: (at plane2 city1) (fuel-level plane2 fl2)
   added: (at plane2 city0) (fuel-level plane2 fl0)
   goals met: 8 of 20
8. (refuel plane2 city0 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 8 of 20
9. (zoom plane1 city0 city7 fl3 fl2 fl1)
   deleted: (at plane1 city0) (fuel-level plane1 fl3)
   added: (at plane1 city7) (fuel-level plane1 fl1)
   goals met: 7 of 20
10. (board person8 plane1 city7)
   deleted: (at person8 city7)
   added: (in person8 plane1)
   goals met: 7 of 20
11. (board person6 plane1 city7)
   deleted: (at person6 city7)
   added: (in person6 plane1)
   goals met: 7 of 20
12. (fly plane1 city7 city4 fl1 fl0)
   deleted: (at plane1 city7) (fuel-level plane1 fl1)
   added: (at plane1 city4) (fuel-level plane1 fl0)
   goals met: 7 of 20
13. (refuel plane1 city4 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 7 of 20
14. (debark person6 plane1 city4)
   deleted: (in person6 plane1)
   added: (at person6 city4)
   goals met: 8 of 20
15. (board person17 plane1 city4)
   deleted: (at person17 city4)
   added: (in person17 plane1)
   goals met: 8 of 20
16. (fly plane1 city4 city0 fl1 fl0)
   deleted: (at plane1 city4) (fuel-level plane1 fl1)
   added: (at plane1 city0) (fuel-level plane1 fl0)
   goals met: 9 of 20
17. (refuel plane1 city0 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 9 of 20
18. (debark person17 plane1 city0)
   deleted: (in person17 plane1)
   added: (at person17 city0)
   goals met: 10 of 20
19. (fly plane1 city0 city9 fl1 fl0)
   deleted: (at plane1 city0) (fuel-level plane1 fl1)
   added: (at plane1 city9) (fuel-level plane1 fl0)
   goals met: 9 of 20
20. (refuel plane1 city9 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 9 of 20
21. (debark person8 plane1 city9)
   deleted: (in person8 plane1)
   added: (at person8 city9)
   goals met: 10 of 20
22. (board person12 plane1 city9)
   deleted: (at person12 city9)
   added: (in person12 plane1)
   goals met: 10 of 20
23. (fly plane1 city9 city4 fl1 fl0)
   deleted: (at plane1 city9) (fuel-level plane1 fl1)
   added: (at plane1 city4) (fuel-level plane1 fl0)
   goals met: 10 of 20
24. (refuel plane1 city4 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 10 of 20
25. (debark person12 plane1 city4)
   deleted: (in person12 plane1)
   added: (at person12 city4)
   goals met: 11 of 20
26. (fly plane1 city4 city0 fl1 fl0)
   deleted: (at plane1 city4) (fuel-level plane1 fl1)
   added: (at plane1 city0) (fuel-level plane1 fl0)
   goals met: 12 of 20
27. (fly plane2 city0 city5 fl1 fl0)
   deleted: (at plane2 city0) (fuel-level plane2 fl1)
   added: (at plane2 city5) (fuel-level plane2 fl0)
   goals met: 11 of 20
28. (refuel plane2 city5 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 11 of 20
29. (debark person2 plane2 city5)
   deleted: (in person2 plane2)
   added: (at person2 city5)
   goals met: 12 of 20
30. (fly plane2 city5 city9 fl1 fl0)
   deleted: (at plane2 city5) (fuel-level plane2 fl1)
   added: (at plane2 city9) (fuel-level plane2 fl0)
   goals met: 12 of 20
31. (refuel plane2 city9 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 12 of 20
32. (debark person16 plane2 city9)
   deleted: (in person16 plane2)
   added: (at person16 city9)
   goals met: 13 of 20
33. (fly plane2 city9 city6 fl1 fl0)
   deleted: (at plane2 city9) (fuel-level plane2 fl1)
   added: (at plane2 city6) (fuel-level plane2 fl0)
   goals met: 13 of 20
34. (refuel plane2 city6 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 13 of 20
35. (board person4 plane2 city6)
   deleted: (at person4 city6)
   added: (in person4 plane2)
   goals met: 13 of 20
36. (fly plane2 city6 city0 fl1 fl0)
   deleted: (at plane2 city6) (fuel-level plane2 fl1)
   added: (at plane2 city0) (fuel-level plane2 fl0)
   goals met: 14 of 20
37. (debark person4 plane2 city0)
   deleted: (in person4 plane2)
   added: (at person4 city0)
   goals met: 15 of 20
38. (zoom plane3 city5 city8 fl2 fl1 fl0)
   deleted: (at plane3 city5) (fuel-level plane3 fl2)
   added: (at plane3 city8) (fuel-level plane3 fl0)
   goals met: 14 of 20
39. (refuel plane3 city8 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 14 of 20
40. (board person9 plane3 city8)
   deleted: (at person9 city8)
   added: (in person9 plane3)
   goals met: 14 of 20
41. (board person13 plane3 city8)
   deleted: (at person13 city8)
   added: (in person13 plane3)
   goals met: 14 of 20
42. (fly plane3 city8 city3 fl1 fl0)
   deleted: (at plane3 city8) (fuel-level plane3 fl1)
   added: (at plane3 city3) (fuel-level plane3 fl0)
   goals met: 14 of 20
43. (refuel plane3 city3 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 14 of 20
44. (debark person9 plane3 city3)
   deleted: (in person9 plane3)
   added: (at person9 city3)
   goals met: 15 of 20
45. (debark person1 plane3 city3)
   deleted: (in person1 plane3)
   added: (at person1 city3)
   goals met: 16 of 20
46. (fly plane3 city3 city0 fl1 fl0)
   deleted: (at plane3 city3) (fuel-level plane3 fl1)
   added: (at plane3 city0) (fuel-level plane3 fl0)
   goals met: 16 of 20
47. (refuel plane3 city0 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 16 of 20
48. (debark person14 plane3 city0)
   deleted: (in person14 plane3)
   added: (at person14 city0)
   goals met: 17 of 20
49. (fly plane3 city0 city4 fl1 fl0)
   deleted: (at plane3 city0) (fuel-level plane3 fl1)
   added: (at plane3 city4) (fuel-level plane3 fl0)
   goals met: 17 of 20
50. (refuel plane3 city4 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 17 of 20
51. (debark person13 plane3 city4)
   deleted: (in person13 plane3)
   added: (at person13 city4)
   goals met: 18 of 20
52. (fly plane3 city4 city7 fl1 fl0)
   deleted: (at plane3 city4) (fuel-level plane3 fl1)
   added: (at plane3 city7) (fuel-level plane3 fl0)
   goals met: 18 of 20
53. (refuel plane3 city7 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 18 of 20
54. (debark person10 plane3 city7)
   deleted: (in person10 plane3)
   added: (at person10 city7)
   goals met: 19 of 20
55. (fly plane3 city7 city5 fl1 fl0)
   deleted: (at plane3 city7) (fuel-level plane3 fl1)
   added: (at plane3 city5) (fuel-level plane3 fl0)
   goals met: 20 of 20
